{
  "posts": [
    {
      "title": "Angular!!! (фреймворк)111",
      "urlPict": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Angular_full_color_logo.svg/1024px-Angular_full_color_logo.svg.png",
      "body": "Angular (версия 2 и выше) — открытая и свободная платформа для разработки веб-приложений, написанная на языке TypeScript, разрабатываемая командой из компании Google, а также сообществом разработчиков из различных компаний. Angular — полностью переписанный фреймворк от той же команды, которая написала AngularJS.",
      "author": "Moskalenko",
      "date": "2022-05-04T21:00:00.000Z",
      "id": 1
    },
    {
      "title": "NodeJs",
      "urlPict": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Node.js_logo.svg/1920px-Node.js_logo.svg.png",
      "body": "Node или Node.js — программная платформа, основанная на движке V8 (компилирующем JavaScript в машинный код), превращающая JavaScript из узкоспециализированного языка в язык общего назначения. Node.js добавляет возможность JavaScript взаимодействовать с устройствами ввода-вывода через свой API, написанный на C++, подключать другие внешние библиотеки, написанные на разных языках, обеспечивая вызовы к ним из JavaScript-кода. Node.js применяется преимущественно на сервере, выполняя роль веб-сервера, но есть возможность разрабатывать на Node.js и десктопные оконные приложения (при помощи NW.js, AppJS или Electron для Linux, Windows и macOS) и даже программировать микроконтроллеры (например, tessel, low.js и espruino). В основе Node.js лежит событийно-ориентированное и асинхронное (или реактивное) программирование с неблокирующим вводом/выводом.",
      "author": "Moskalenko",
      "date": "2022-05-24T12:42:01.263Z",
      "id": 3
    },
    {
      "title": "Vue1123",
      "urlPict": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Vue.js_Logo_2.svg/1024px-Vue.js_Logo_2.svg.png",
      "body": "Vue.js (также Vue; /vjuː/) — JavaScript-фреймворк с открытым исходным кодом для создания пользовательских интерфейсов[3]. Легко интегрируется в проекты с использованием других JavaScript-библиотек. Может функционировать как веб-фреймворк для разработки одностраничных приложений в реактивном стиле.  На данный момент поддерживается создателем Эваном Ю и остальными активными членами основной команды из различных компаний, таких как Netlify, Netguru, Baidu, Livestorm[4].  Опрос, проведенный в 2016 году для JavaScript, показал, что Vue имеет 89 % удовлетворенности разработчиков[5]. На GitHub проект имеет 188 тысяч звезд[6], является третьим по величине проектом в истории GitHub[",
      "author": "Москаленко",
      "date": "2022-05-24T12:44:39.459Z",
      "id": 4
    },
    {
      "title": "JavaScript!!!!!!!!!",
      "urlPict": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/80px-Unofficial_JavaScript_logo_2.svg.png",
      "body": "JavaScript (/ˈdʒɑːvɑːˌskrɪpt/; аббр. JS /ˈdʒeɪ.ɛs./) — мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript (стандарт ECMA-262[9]).  JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам[10].  Основные архитектурные черты: динамическая типизация, слабая типизация, автоматическое управление памятью, прототипное программирование, функции как объекты первого класса.  На JavaScript оказали влияние многие языки, при разработке была цель сделать язык похожим на Java. Языком JavaScript не владеет какая-либо компания или организация, что отличает его от ряда языков программирования, используемых в веб-разработке[~ 1][11].",
      "author": "Moskalenko",
      "date": "2022-07-01T07:25:09.808Z",
      "id": 5
    },
    {
      "title": "Java",
      "urlPict": "https://upload.wikimedia.org/wikipedia/ru/thumb/3/39/Java_logo.svg/43px-Java_logo.svg.png",
      "body": "Java[прим. 1] — строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems (в последующем приобретённой компанией Oracle). Разработка ведётся сообществом, организованным через Java Community Process; язык и основные реализующие его технологии распространяются по лицензии GPL. Права на торговую марку принадлежат корпорации Oracle.  Приложения Java обычно транслируются в специальный байт-код, поэтому они могут работать на любой компьютерной архитектуре, для которой существует реализация виртуальной Java-машины. Дата официального выпуска — 23 мая 1995 года. Занимает высокие места в рейтингах популярности языков программирования (2-е место в рейтингах IEEE Spectrum ",
      "author": "Moskalenko",
      "date": "2022-07-07T10:21:42.802Z",
      "id": 6
    }
  ],
  "signUpUsers": [
    {
      "email": "msy2707@mail.ru",
      "password": "27071996",
      "id": 1
    },
    {
      "email": "a",
      "password": "a",
      "id": 2
    },
    {
      "email": "asdfa@asdf",
      "password": "123456",
      "id": 3
    },
    {
      "email": "123@sd",
      "password": "123456",
      "id": 4
    },
    {
      "email": "123@fasd",
      "password": "123456",
      "id": 5
    },
    {
      "id": 6
    },
    {
      "email": "123@231",
      "password": "123456",
      "id": 7
    },
    {
      "email": "123@123",
      "password": "123456",
      "id": 8
    },
    {
      "email": "msy2707@mail.ru",
      "password": "Ronaldo7",
      "id": 9
    },
    {
      "email": "000@000",
      "password": "000000",
      "id": 10
    }
  ]
}